Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་གིས་བསྐལ་པ་སྟོང་དུ་ཐབས་མཁས་པ་མ་གཏོགས་པར། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དག་ལ་སྤྱད་པ་བས་ནི། ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་རྗེས་སུ་ཡི་རང་བར་བྱས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདི་ལ། བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། དཔེའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ། །
en: “Prāmodyarāja, compared to the amount of merit accomplished by a bodhisattva who has practiced the six perfections with comprehensive skill throughout one thousand eons, the merit that arises when hearing about this absorption and rejoicing is far greater—beyond all comparison.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: When the Blessed One gave this Dharma teaching, innumerable bodhisattvas gave rise to the mind of unexcelled perfect and complete awakening, and

source: དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: they all irreversibly attained unexcelled perfect and complete awakening.

source: ལྷ་དང་མིའི་སྐྱེ་དགུའི་ཚོགས་བརྒྱད་འབུམ་སྙེད་ཀྱང་། རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ལ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ །
en: Moreover, eight hundred thousand gods and humans attained the pure Dharma eye that beholds phenomena immaculately and without stain.

source: ལྷ་དེ་དག་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་ལ་མངོན་པར་དགའ་བའི་ཕྱིར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དག་མེ་ཏོག་གིས་ཆལ་པར་བཀྲམ་པར་གྱུར་ཏོ། །
en: Since the eyes of those gods were now pure, they delighted in the Blessed One’s Dharma and scattered flowers throughout this trichiliocosm.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །བར་སྣང་ལས་ཀྱང་ལྷའི་རྔ་སྒྲ་དག་བསྒྲགས་སོ། །
en: The trichiliocosm shook in six distinctive ways, and the sounds of divine drums filled the air.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་སྙེད་ཐམས་ཅད་ཀྱིས་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ཐོབ་བོ། །
en: Prāmodyarāja, along with all the millions of other bodhisattvas, attained this meditative absorption.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་སོགས་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ།། །།
en: When the Blessed One had said these words, Prāmodyarāja and all the other bodhisattva great beings—as well as the whole world with its gods, humans, asuras, and gandharvas—rejoiced and praised the words of the Blessed One.

source: འཕགས་པ་བསྐལ་པ་བཟང་པོ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སྷོ།། །།
en: This completes the noble sūtra of the Great Vehicle, known as “The Good Eon.”

source: རྒྱ་གར་གྱི་མཁན་པོ་བིདྱཱ་ཀ་ར་སིང་ཧ་དང་། ལོཙྪ་བ་བན་དེ་དཔལ་གྱི་དབྱངས་ཀྱིས་བསྒྱུར། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་དཔལ་བརྩེགས་ཀྱིས་ཞུས་ཏེ་
en: This translation was produced by the Indian preceptor Vidyākara­siṁha and the translator Venerable Palgyi Yang. The translation was revised and finalized by the great translator-editor Venerable Paltsek.

source: གཏན་ལ་ཕབ་པ།། །།ཤུ་བྷ་མསྟུ་སརྦ་ཛ་ག་ཏཱཾ།། །།ཡེ་དྷརྨཱ་ཧེ་ཏུ་པྲ་བྷ་ཝཱ་ཧེ་དུནྟེ་ཥཱན་ཏ་ཐཱ་ག་ཏོ་ཧྱ་བད་ཏ། ཏེ་ཥཱཉྩ་ཡོ་ནི་རོ་དྷ་ཨེ་ཝཱཾ་བཱ་དཱི་མ་ཧཱ་ཤྲ་མ་ཎཿ། མག་ལ་བྷ་བནྟུ།། །
en: Śubhaṁ astu sarvaja gatāṁ Oṃ ye dharmā hetuprabhavā hetuṃ teṣāṃ tathāgato hy avadat, teṣāṃ ca yo nirodha evaṃvādī mahāśramaṇaḥ Maṅgala bhavatu
